/*
Navicat MySQL Data Transfer

Source Server         : 47.94.129.192
Source Server Version : 50639
Source Host           : 47.94.129.192:8306
Source Database       : manage-fast

Target Server Type    : MYSQL
Target Server Version : 50639
File Encoding         : 65001

Date: 2018-12-11 17:53:26
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for `sys_course_type`
-- ----------------------------
DROP TABLE IF EXISTS `sys_course_type`;
CREATE TABLE `sys_course_type` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `name` varchar(50) DEFAULT NULL COMMENT '名称',
  `branch_id` bigint(20) DEFAULT NULL COMMENT '门店ID',
  `branch_name` varchar(50) DEFAULT NULL COMMENT '门店名称',
  `keep_pro` int(11) DEFAULT NULL COMMENT '健身项目KEY',
  `keep_pro_name` varchar(50) DEFAULT NULL COMMENT '健身项目名称',
  `course_category` int(11) DEFAULT NULL COMMENT '课程类型KEY',
  `course_category_name` varchar(50) DEFAULT NULL COMMENT '课程类型名称',
  `charge_mode` tinyint(4) DEFAULT NULL COMMENT '计费方式',
  `days` int(11) DEFAULT NULL COMMENT '有效期(天)',
  `price` float DEFAULT NULL COMMENT '价钱',
  `count` int(11) DEFAULT NULL COMMENT '课程节数',
  `time_length` int(11) DEFAULT NULL COMMENT '课程时长',
  `on_sale` tinyint(4) DEFAULT NULL COMMENT '是否在售',
  `img_path` varchar(255) DEFAULT NULL COMMENT '图片地址',
  `course_type_describe` varchar(500) DEFAULT NULL COMMENT '描述',
  `color` varchar(10) DEFAULT '#3a87ad' COMMENT '课种颜色',
  `is_common` tinyint(4) DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=120 DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC COMMENT='课种';

-- ----------------------------
-- Records of sys_course_type
-- ----------------------------
INSERT INTO `sys_course_type` VALUES ('1', '哈它瑜伽', '2', '702俱乐部', '1', '瑜伽', '3', '免费团课', '5', null, null, null, '60', '1', 'course/fdde14840c2d4f6e87acb4e2b276f697.jpg', '亚茹的课', '#19BE6B', '0');
INSERT INTO `sys_course_type` VALUES ('2', '高温瑜伽私教', '2', '702俱乐部', '1', '瑜伽', '1', '单人私教', '2', '90', '0.01', '20', '60', '1', 'course/39b95ae20a4a459c94e825171b7188ed.jpg', '很棒的一节课', '#3a87ad', '0');
INSERT INTO `sys_course_type` VALUES ('3', '30节瑜伽蹈小团体', '2', '701俱乐部', '1', '瑜伽', '2', '小团体私教', '2', '90', '0.01', '30', '60', '1', 'course/df2ea8fee9154003b9a5ccee24708cf3.jpg', null, '#3a87ad', '0');
INSERT INTO `sys_course_type` VALUES ('4', '30节高级瑜伽', '2', '701俱乐部', '1', '瑜伽', '2', '小团体私教', '2', '60', '600', '30', '60', '1', 'course/e6946135308a429a955fd87d109528a1.png', '哈哈哈哈', '#3a87ad', '0');
INSERT INTO `sys_course_type` VALUES ('5', '哈他瑜伽', '6', '动岚健身克东店', '1', '哈他瑜伽', '3', '免费团课', '5', null, null, null, '60', '1', 'course/284e541181a847c8a254848bd5024ec9.png', '瑜伽通过各种瑜伽动作，可以达到平时根本无法做到的体位拉伸，可以有效的排出体内毒素，有美容增加柔韧能力的作用', '#3a87ad', '0');
INSERT INTO `sys_course_type` VALUES ('6', '有氧舞蹈', '6', '动岚健身克东店', '16', '有氧舞蹈', '3', '免费团课', '5', null, null, null, '60', '1', 'course/23bf9fda6a8e4aaa993a92ea26ad94c1.png', '有氧舞蹈', '#3a87ad', '0');
INSERT INTO `sys_course_type` VALUES ('7', '战斗有氧', '6', '动岚健身克东店', '3', '战斗有氧', '3', '免费团课', '5', null, null, null, '60', '1', 'course/4394cb2be57f411583f65a442a0a0e07.png', 'Body  combat 战斗有氧，源自于一系列搏击格斗动作，是将中国武术、泰拳、西洋拳击、空手道和跆拳道等结合的一起，是大学和健身房都开的课程。可以减脂塑形，改善心肺功能，提高动作的敏捷性，调节情绪，建立自信，并且能够自我防卫', '#3a87ad', '0');
INSERT INTO `sys_course_type` VALUES ('8', '踏板操', '6', '动岚健身克东店', '10', '踏板操', '3', '免费团课', '5', null, null, null, '60', '1', 'course/35f29abd670f449f951b07d75d471ac7.png', '踏板操', '#3a87ad', '0');
INSERT INTO `sys_course_type` VALUES ('9', '南美拉丁', '6', '动岚健身克东店', '15', '南美拉丁', '3', '免费团课', '5', null, null, null, '60', '1', 'course/cafa72429697436ab2ea779bc2c3af9d.png', '南美拉丁', '#3a87ad', '0');
INSERT INTO `sys_course_type` VALUES ('10', '尊巴', '6', '动岚健身克东店', '14', '尊吧', '3', '免费团课', '5', null, null, null, '60', '1', 'course/92c76716608a45b59130c195c1e25362.png', '尊巴舞蹈', '#3a87ad', '0');
INSERT INTO `sys_course_type` VALUES ('11', '3D动感单车', '6', '动岚健身克东店', '4', '3D动感单车', '3', '免费团课', '5', null, null, null, '60', '1', 'course/f13a27a7135e45f390b23af3ffbd2ca9.png', '动感单车号称燃脂炸弹快速燃烧您的脂肪让您快速美起来', '#3a87ad', '0');
INSERT INTO `sys_course_type` VALUES ('12', '蹦床操', '6', '动岚健身克东店', '13', '蹦床操', '3', '免费团课', '5', null, null, null, '60', '1', 'course/b1fe517a1ab042cb99531c0648977350.png', '蹦床操燃脂瘦身', '#3a87ad', '0');
INSERT INTO `sys_course_type` VALUES ('13', '燃脂单车', '6', '动岚健身克东店', '9', '燃脂单车', '3', '免费团课', '5', null, null, null, '60', '1', 'course/5139be21b8d54f51b470f9476d4622d3.png', '单车种类中的一种', '#3a87ad', '0');
INSERT INTO `sys_course_type` VALUES ('14', '1807新报课程', '5', '动岚健身学院', '6', '全能舞蹈', '1', '单人私教', '1', '15', '3000', '15', '60', '2', 'course/c56d2cbc50a84d90b89fe7ac1ff29725.jpg', '有氧舞蹈+南美拉丁', '#3a87ad', '0');
INSERT INTO `sys_course_type` VALUES ('15', '10节私教课程', '8', '动岚健身平顶山店', '3', '自由力量', '1', '单人私教', '1', '30', '2000', '10', '60', '1', 'course/99bf01874b754c889b7f997284b005f3.jpg', '通过一对一私教课程，达到增肌、塑型、减脂、改善亚健康的效果。', '#3a87ad', '0');
INSERT INTO `sys_course_type` VALUES ('16', '发呗v', '11', '动岚健身酒泉店', '1', '普拉提', '3', '免费团课', '5', null, null, null, '60', '2', 'course/986174ab5f544021babf4bea3fc7ab09.jpg', '任天堂拖拖拖拖拖', '#000000', '0');
INSERT INTO `sys_course_type` VALUES ('17', '一对一私教', '11', '动岚健身酒泉店', '22', '私教一对一减脂', '1', '单人私教', '4', '365', '200', '20', '60', '1', 'course/eae439f3313e40dfbcc48666a3b5cd23.jpg', '针对不同会员不同身体素质制定专业一对一减脂课程，在最短的时间内合理科学的让会员达到最好的减脂效果', '#2D8CF0', '0');
INSERT INTO `sys_course_type` VALUES ('18', '一对一减脂', '11', '动岚健身酒泉店', '22', '私教一对一减脂', '1', '单人私教', '2', '365', '200', '1', '60', '2', 'course/96827dc267e24120b280ecc92b09584a.jpg', '一对一，根据每个人不同的体能，进行一对一上课指导', '#19BE6B', '0');
INSERT INTO `sys_course_type` VALUES ('19', '速度与激情', '16', '美乐健身一店', '2', '动感单车', '3', '免费团课', '5', null, null, null, '40', '1', 'course/6d464c2f98064641830e9e6b38b8c392.png', '动感单车，又名燃脂炸弹 英文名字（SPINNING），是由美国私人教练兼极限运动员JOHNNYG于二十世纪八十年代首创，是一种结合了音乐、视觉效果等独特的充满活力的室内自行车训练课程。\n动感单车在克服了室外行驶的一切缺点后，由于技术上的改进，使得这项运动在简单易学之余，成为一项能够使全身得到锻炼的有氧运动。', '#19BE6B', '0');
INSERT INTO `sys_course_type` VALUES ('20', '杠铃操', '16', '美乐健身一店', '11', '杠铃操', '3', '免费团课', '5', null, null, null, '60', '1', 'course/686a9061efab405f910abf7c0c7e4d2d.jpg', '杠铃操 世界上最快的塑身方法是健身史上最成功的集体健身项目，世界上最快塑造形体、减少脂肪的运动。它成功地将杠铃引入操房，运用杠铃达到良好的塑身效果，将有氧运动与无氧运动完美结合，带来了集体健身的革命性突破。简单易学，成为增强体力和自信的起点。富有节奏的音乐和新颖的动作编排，伴随您完成1小时的练习。在热情高涨、激动人心的氛围中进行身体锻炼，适合每个想将力量训练与有氧训练结合起来的人。', '#9B1DEA', '0');
INSERT INTO `sys_course_type` VALUES ('21', '蹦床操', '16', '动岚健身美乐一店', '12', '蹦床操', '3', '免费团课', '5', null, null, null, '60', '1', 'course/fae17af615eb4cd580cda33c64ef9278.jpg', '蹦床操 是一项利用从蹦床反弹中表现杂技技巧的竞技运动，它属于体操运动的一种，一节课40分钟的课程，就能够燃烧700千卡以上的热量！具有蹦床操有“空中芭蕾”之称。', '#FF9900', '0');
INSERT INTO `sys_course_type` VALUES ('22', '踏板操', '16', '动岚健身美乐一店', '10', '有氧踏板', '3', '免费团课', '5', null, null, null, '60', '1', 'course/e7e2d1102c514202a553f2ea3bf96cea.jpg', '踏板操：主要针对下肢和臀部具有明显耗能减脂，提臀美腿一节课可以消耗1000卡路里，具有改善女性肌肉线条功效。', '#ED4014', '0');
INSERT INTO `sys_course_type` VALUES ('23', '有氧搏击', '16', '美乐健身一店', '4', '搏击操', '3', '免费团课', '5', null, null, null, '60', '1', 'course/3b51ea4b859f40aaa5c2d3cc70fb44af.jpg', '搏击操，是一种有氧操，它结合了拳击、泰拳、跆拳道、散手、太极的基本动作，遵循健美操最新编排方法，在强有力的音乐节拍下完成的一种身体锻炼方式。有氧搏击操英文名为kickboxing，最早是由欧洲的搏击选手与职业健身操运动员推出的，其具体形式是将拳击、空手道、跆拳道功夫，甚至一些舞蹈动作混合在一起，并配合强劲的音乐，成为一类风格独特的健身操。', '#00B5FF', '0');
INSERT INTO `sys_course_type` VALUES ('24', '疯狂单车', '17', '动岚健身美乐二店', '1', '动感单车', '3', '免费团课', '5', null, null, null, '40', '1', 'course/c48d566f1df7426a98313de73dc2fb01.png', '动感单车，又名燃脂炸弹 英文名字（SPINNING），是由美国私人教练兼极限运动员JOHNNYG于二十世纪八十年代首创，是一种结合了音乐、视觉效果等独特的充满活力的室内自行车训练课程。\n动感单车在克服了室外行驶的一切缺点后，由于技术上的改进，使得这项运动在简单易学之余，成为一项能够使全身得到锻炼的有氧运动。\n\n', '#2D8CF0', '0');
INSERT INTO `sys_course_type` VALUES ('25', '私教课', '16', '美乐健身一店', '1', '私教课', '1', '单人私教', '2', '1', '200', '1', '60', '2', 'course/ed3122a9b8dd4bde9731eedc70ea0c42.png', '有效快速达到训练效果', '#000000', '0');
INSERT INTO `sys_course_type` VALUES ('26', '私教课', '16', '美乐健身一店', '1', '私教课', '1', '单人私教', '2', '1', '200', '1', '60', '1', 'course/ed3122a9b8dd4bde9731eedc70ea0c42.png', '有效快速达到训练效果', '#000000', '0');
INSERT INTO `sys_course_type` VALUES ('27', '有氧搏击', '17', '动岚健身美乐二店', '2', '有氧搏击', '3', '免费团课', '5', null, null, null, '60', '1', 'course/a9244d67970e4c2798c64098fea67770.jpg', '搏击操，是一种有氧操，它结合了拳击、泰拳、跆拳道、散手、太极的基本动作，遵循健美操最新编排方法，在强有力的音乐节拍下完成的一种身体锻炼方式。有氧搏击操英文名为kickboxing，最早是由欧洲的搏击选手与职业健身操运动员推出的，其具体形式是将拳击、空手道、跆拳道功夫，甚至一些舞蹈动作混合在一起，并配合强劲的音乐，成为一类风格独特的健身操。', '#19BE6B', '0');
INSERT INTO `sys_course_type` VALUES ('28', '有氧踏板', '17', '动岚健身美乐二店', '3', '有氧踏板', '3', '免费团课', '5', null, null, null, '60', '1', 'course/c399994dfd7545a48bae5d0b722e1dcc.jpg', '踏板操：主要针对下肢和臀部具有明显耗能减脂，提臀美腿一节课可以消耗1000卡路里，具有改善女性肌肉线条功效。', '#FF9900', '0');
INSERT INTO `sys_course_type` VALUES ('29', '有氧杠铃操', '17', '美乐健身二店', '4', '杠铃操', '3', '免费团课', '5', null, null, null, '60', '1', 'course/75cc96d0d25f40e8a9a882f6536602ef.jpg', '杠铃操 世界上最快的塑身方法是健身史上最成功的集体健身项目，世界上最快塑造形体、减少脂肪的运动。它成功地将杠铃引入操房，运用杠铃达到良好的塑身效果，将有氧运动与无氧运动完美结合，带来了集体健身的革命性突破。简单易学，成为增强体力和自信的起点。富有节奏的音乐和新颖的动作编排，伴随您完成1小时的练习。在热情高涨、激动人心的氛围中进行身体锻炼，适合每个想将力量训练与有氧训练结合起来的人。', '#ED4014', '0');
INSERT INTO `sys_course_type` VALUES ('30', '蹦床操', '17', '美乐健身二店', '5', '蹦床操', '3', '免费团课', '5', null, null, null, '60', '1', 'course/548dac25f1194702be1ede430a4c1ece.jpg', '蹦床操 是一项利用从蹦床反弹中表现杂技技巧的竞技运动，它属于体操运动的一种，一节课40分钟的课程，就能够燃烧700千卡以上的热量！具有蹦床操有“空中芭蕾”之称。', '#00B5FF', '0');
INSERT INTO `sys_course_type` VALUES ('31', '肚皮舞', '16', '美乐健身一店', '3', '肚皮舞', '3', '免费团课', '5', null, null, null, '60', '1', 'course/74c879b2b268469f8002e2efc75f2666.jpg', '肚皮舞是较为女性的舞蹈，其特色是舞者随着变化万千的快速节奏摆动臀部和腹部，舞姿优美，变化多端，而且多彰显阿拉伯风情，以神秘著称。近些年，肚皮舞也作为一种深受女士喜爱的减肥方式在世界各地广为流行。', '#607D8B', '0');
INSERT INTO `sys_course_type` VALUES ('32', '基础瑜伽', '16', '美乐健身一店', '8', '基础瑜伽', '3', '免费团课', '5', null, null, null, '60', '1', 'course/29e8b84e93bd4510a85f13281530b318.jpg', '基础瑜伽  瑜伽是一项有着5000年历史的关于身体、心理以及精神的练习，起源于印度，其目的是改善您的身体和心性', '#CDDC39', '0');
INSERT INTO `sys_course_type` VALUES ('33', '理疗瑜伽', '16', '美乐健身一店', '7', '理疗瑜伽', '3', '免费团课', '5', null, null, null, '60', '1', 'course/cb8121ef75df4d0bb89a791bab9901a4.jpg', '瑜伽理疗是把瑜伽的方法运用在治疗方面，它提供健康和疾病理论上的阐解。它同样给我们练习的建议，如何保持健康和治疗疾病，使得达到健康长寿。阿育吠陀的理论使我们理解如何和为什么运用瑜伽的方法进行治疗。', '#F06292', '0');
INSERT INTO `sys_course_type` VALUES ('34', '瘦身瑜伽', '16', '美乐健身一店', '9', '瘦身瑜伽', '3', '免费团课', '5', null, null, null, '60', '1', 'course/c0e50df13d0145d19c6753617a603003.jpg', '瘦身瑜伽针对身体细部及整，全面塑造健康，完美的体形，并通过这些简明，专业而饶有趣味的练习，进一步激发机体潜能，增强机体内部力量，提高身体柔韧性，平衡性，减缓精神压力，让你随时随地感到精力充沛，心情舒畅!', '#F06292', '0');
INSERT INTO `sys_course_type` VALUES ('35', 'HIIT体能训练', '16', '美乐健身一店', '14', 'HIIT体能训练', '3', '免费团课', '5', null, null, null, '60', '1', 'course/ff956a420d9e4c5793ccc032901ad094.jpg', '体能是通过力量、速度、耐力、协调、柔韧、灵敏等运动素质表现出来的人体基本的运动能力，是运动员竞技能力的重要构成因素。体能水平的高低与人体的形态学特征以及人体的机能特征有着密切的相关 。', '#5D4037', '0');
INSERT INTO `sys_course_type` VALUES ('36', '流瑜伽', '16', '美乐健身一店', '22', '流瑜伽', '3', '免费团课', '5', null, null, null, '60', '1', 'course/a4091b56f2064ae39bf8638888b290da.jpg', '流瑜伽在练习的过程中以行如流水般流畅的动作组合来强健身体，它侧重伸展性，力量性，柔韧性，耐力，平衡性，专注力。\n流瑜伽，瑜伽的一种类型，是时下很流行的一种瑜伽，它的体式之间的衔接给人一气呵成之感，所以被称为\"流瑜伽\"。', '#FEBD79', '0');
INSERT INTO `sys_course_type` VALUES ('37', '动感单车', '18', '美乐健身三店', '1', '动感单车', '3', '免费团课', '5', null, null, null, '40', '1', 'course/35c833210ebc4554b0a529a72aedce56.jpg', '动感单车，又名燃脂炸弹 英文名字（SPINNING），是由美国私人教练兼极限运动员JOHNNYG于二十世纪八十年代首创，是一种结合了音乐、视觉效果等独特的充满活力的室内自行车训练课程。\n动感单车在克服了室外行驶的一切缺点后，由于技术上的改进，使得这项运动在简单易学之余，成为一项能够使全身得到锻炼的有氧运动。\n', '#2D8CF0', '0');
INSERT INTO `sys_course_type` VALUES ('38', '哈他瑜伽', '16', '美乐健身一店', '15', '哈他瑜伽', '3', '免费团课', '5', null, null, null, '60', '1', 'course/25fb893911eb4f849e7327cb7706cb6f.jpg', 'Hatha（哈他）伽这是一种传统的伽练习，适合任何级别的练习者，对身体的各部位进行科学而平衡的伸展和锻炼，达到通经脉改善呼吸、平衡身心的功效。是由许多确伽势组成。，但不像 Ashtanga（阿斯汤伽）那样有连性，较容易些，但同样有挑战性哈他瑜伽通过体位练习达到强身健体，畸通经脉，同时练习会带来专注和思想的纯洁健康，人体包括两个体系为精神体系，一为肌体体系。', '#1D35EA', '0');
INSERT INTO `sys_course_type` VALUES ('39', '尊巴', '16', '美乐健身一店', '20', '尊巴', '3', '免费团课', '5', null, null, null, '60', '1', 'course/c366c3c905644ed48d7b80238b299c1f.jpg', 'Zumba将热辣、性感的拉丁舞蹈和国际音乐舞蹈相结合，自成一套动感的、兴奋的、有效的有氧运动，它通过动态的运动形式实现了节奏性。它结合了南美火爆、热辣的拉丁舞蹈体系，包括 SALSA舞、 MERENUE舞、 CUMBIA舞。它的特点是通过有氧间歇训练与快、慢节奏音乐相结合的形式进行型身。 Zumba利用间歌训练和抗阻训练的理论，实现最大卡路里消耗，燃烧脂肪与全身均衡发展。它将塑身的动作与商单的舞步结合在一起，以特殊的循序渐进的节奏中心，以简单的舞步开始，然后变为全身各部位的练习。', '#8BC34A', '0');
INSERT INTO `sys_course_type` VALUES ('40', '拉丁舞', '16', '美乐健身一店', '21', '拉丁舞', '3', '免费团课', '5', null, null, null, '60', '1', 'course/89a01762922142c6b2d66058588822cf.jpg', '单纯传统的健身运动越来越满足不了人们的需求，就给它加入新的拉丁舞元素，人们在感受拉丁热力的同时强健身体，可谓两全其美。传统的拉丁舞起源于非洲和拉丁美洲，具有热情、奔放、浪漫的风格特点，其舞蹈动作豪放粗犷，速度多变，手势和脚步内容丰富，充满激情，音乐节奏鲜明强烈。', '#8BC34A', '0');
INSERT INTO `sys_course_type` VALUES ('41', '流行舞', '16', '美乐健身一店', '6', '流行舞', '3', '免费团课', '5', null, null, null, '60', '1', 'course/7c5d74e866174f26b4c31a07009b7fa2.jpg', '流行舞具有广泛的群众性和强烈的自娱性，是浅层审美意识的载体，它包括标准舞、爵士舞、街舞、拉丁舞、踢踏舞、迪斯科、劲舞等种类繁多的舞蹈。流行舞现在已经成为一种大众化的舞蹈，适合各个年龄，各个阶层的人群来学习，不论年龄，不分性别，都可以利用跳舞来达到自己的健身目的。', '#F06292', '0');
INSERT INTO `sys_course_type` VALUES ('42', '普拉提', '16', '美乐健身一店', '17', '普拉提', '3', '免费团课', '5', null, null, null, '60', '1', 'course/def55536dd19439791535f96596a981a.jpg', '普拉提运动概念：普拉提首先是一种运动。它主要是锻炼人体深层的小肌肉群，维持和改善外观正常活动姿势、达到身体平衡、创展躯干和肢体的活动范围和活动能力、强调对核心肌群的控制、加强人脑对肢体及骨骼肌肉组织的神经感应及支配，再配合正确的呼吸方法所进行的一项全身协调运动。', '#EA1A1A', '0');
INSERT INTO `sys_course_type` VALUES ('43', '舞韵瑜伽', '16', '美乐健身一店', '18', '舞韵瑜伽', '3', '免费团课', '5', null, null, null, '60', '1', 'course/fbf48e9cec024d9b9895e4d87b6bf55d.jpg', '舞韵瑜伽是将更多的瑜伽体式和舞蹈元素进行了揉和，同时配合专业音乐疗法，功能与技能相结合后创编而成的瑜伽。在舞韵瑜伽练习的过程中，可以使人们深切的感到生命的鲜活与灵动，更能在保证健康平衡的基础上，提升气质、塑造形体、陶冶情操。', '#F9E31C', '0');
INSERT INTO `sys_course_type` VALUES ('44', '基础瑜伽', '17', '美乐健身二店', '6', '基础瑜伽', '3', '免费团课', '5', null, null, null, '60', '1', 'course/468071d8abbb478f878666f6dcd5020c.jpg', '基础瑜伽  瑜伽是一项有着5000年历史的关于身体、心理以及精神的练习，起源于印度，其目的是改善您的身体和心', '#19C919', '0');
INSERT INTO `sys_course_type` VALUES ('45', '瘦身瑜伽', '17', '美乐健身二店', '7', '瘦身瑜伽', '3', '免费团课', '5', null, null, null, '60', '1', 'course/5a68ebfb3ff2489bbd2fec6519d7e769.jpg', '瘦身瑜伽针对身体细部及整，全面塑造健康，完美的体形，并通过这些简明，专业而饶有趣味的练习，进一步激发机体潜能，增强机体内部力量，提高身体柔韧性，平衡性，减缓精神压力，让你随时随地感到精力充沛，心情舒畅!', '#F9E31C', '0');
INSERT INTO `sys_course_type` VALUES ('46', '理疗瑜伽', '17', '美乐健身二店', '8', '理疗瑜伽', '3', '免费团课', '5', null, null, null, '60', '1', 'course/35c8d3f304164488a75e62b60016700d.jpg', '瑜伽理疗是把瑜伽的方法运用在治疗方面，它提供健康和疾病理论上的阐解。它同样给我们练习的建议，如何保持健康和治疗疾病，使得达到健康长寿。阿育吠陀的理论使我们理解如何和为什么运用瑜伽的方法进行治疗。', '#EA1A1A', '0');
INSERT INTO `sys_course_type` VALUES ('47', '哈他瑜伽', '17', '美乐健身二店', '10', '哈他瑜伽', '3', '免费团课', '5', null, null, null, '60', '1', 'course/dcb6714dcba74373a77f1d4cda822c4e.jpg', 'Hatha（哈他）伽这是一种传统的伽练习，适合任何级别的练习者，对身体的各部位进行科学而平衡的伸展和锻炼，达到通经脉改善呼吸、平衡身心的功效。是由许多确伽势组成。，但不像 Ashtanga（阿斯汤伽）那样有连性，较容易些，但同样有挑战性哈他瑜伽通过体位练习达到强身健体，畸通经脉，同时练习会带来专注和思想的纯洁健康，人体包括两个体系为精神体系，一为肌体体系。', '#9B1DEA', '0');
INSERT INTO `sys_course_type` VALUES ('48', '舞韵瑜伽', '17', '美乐健身二店', '12', '舞韵瑜伽', '3', '免费团课', '5', null, null, null, '60', '1', 'course/cb870d9ebdd54ec6aa40f8bec0c28141.jpg', '舞韵瑜伽是将更多的瑜伽体式和舞蹈元素进行了揉和，同时配合专业音乐疗法，功能与技能相结合后创编而成的瑜伽。在舞韵瑜伽练习的过程中，可以使人们深切的感到生命的鲜活与灵动，更能在保证健康平衡的基础上，提升气质、塑造形体、陶冶情操。', '#00C2B1', '0');
INSERT INTO `sys_course_type` VALUES ('49', '普拉提', '17', '美乐健身二店', '15', '普拉提', '3', '免费团课', '5', null, null, null, '60', '1', 'course/463c746d5bf14a3ea5c00174a7d5a0fe.jpg', '拉提运动概念：普拉提首先是一种运动。它主要是锻炼人体深层的小肌肉群，维持和改善外观正常活动姿势、达到身体平衡、创展躯干和肢体的活动范围和活动能力、强调对核心肌群的控制、加强人脑对肢体及骨骼肌肉组织的神经感应及支配，再配合正确的呼吸方法所进行的一项全身协调运动。', '#00C2B1', '0');
INSERT INTO `sys_course_type` VALUES ('50', '肚皮舞', '17', '美乐健身二店', '17', '肚皮舞', '3', '免费团课', '5', null, null, null, '60', '1', 'course/6d872aaebd5042cf8fb9cb00ac07f280.jpg', '肚皮舞是较为女性的舞蹈，其特色是舞者随着变化万千的快速节奏摆动臀部和腹部，舞姿优美，变化多端，而且多彰显阿拉伯风情，以神秘著称。近些年，肚皮舞也作为一种深受女士喜爱的减肥方式在世界各地广为流行。', '#AC7A33', '0');
INSERT INTO `sys_course_type` VALUES ('51', '尊巴', '17', '美乐健身二店', '18', '尊巴', '3', '免费团课', '5', null, null, null, '60', '1', 'course/e6c99fab165c496fa9a11c2077ecc3b8.jpg', 'Zumba将热辣、性感的拉丁舞蹈和国际音乐舞蹈相结合，自成一套动感的、兴奋的、有效的有氧运动，它通过动态的运动形式实现了节奏性。它结合了南美火爆、热辣的拉丁舞蹈体系，包括 SALSA舞、 MERENUE舞、 CUMBIA舞。它的特点是通过有氧间歇训练与快、慢节奏音乐相结合的形式进行型身。 Zumba利用间歌训练和抗阻训练的理论，实现最大卡路里消耗，燃烧脂肪与全身均衡发展。它将塑身的动作与商单的舞步结合在一起，以特殊的循序渐进的节奏中心，以简单的舞步开始，然后变为全身各部位的练习。', '#1D35EA', '0');
INSERT INTO `sys_course_type` VALUES ('52', '拉丁舞', '17', '美乐健身二店', '19', '拉丁舞', '3', '免费团课', '5', null, null, null, '60', '1', 'course/5ff92cbe13574dd5b863a17c87240f15.jpg', '单纯传统的健身运动越来越满足不了人们的需求，就给它加入新的拉丁舞元素，人们在感受拉丁热力的同时强健身体，可谓两全其美。传统的拉丁舞起源于非洲和拉丁美洲，具有热情、奔放、浪漫的风格特点，其舞蹈动作豪放粗犷，速度多变，手势和脚步内容丰富，充满激情，音乐节奏鲜明强烈。', '#1D35EA', '0');
INSERT INTO `sys_course_type` VALUES ('53', '体能训练', '17', '美乐健身二店', '20', 'HIIT体能训练', '3', '免费团课', '5', null, null, null, '60', '1', 'course/b11f4a61dab6460b94437c98f033af44.jpg', '体能是通过力量、速度、耐力、协调、柔韧、灵敏等运动素质表现出来的人体基本的运动能力，是运动员竞技能力的重要构成因素。体能水平的高低与人体的形态学特征以及人体的机能特征有着密切的相关 。', '#1D35EA', '0');
INSERT INTO `sys_course_type` VALUES ('54', '流瑜伽', '17', '美乐健身二店', '21', '流瑜伽', '3', '免费团课', '5', null, null, null, '60', '1', 'course/1db67280adba4e3cb49b5949cd967970.jpg', '流瑜伽在练习的过程中以行如流水般流畅的动作组合来强健身体，它侧重伸展性，力量性，柔韧性，耐力，平衡性，专注力。\n流瑜伽，瑜伽的一种类型，是时下很流行的一种瑜伽，它的体式之间的衔接给人一气呵成之感，所以被称为\"流瑜伽\"。\n', '#8BC34A', '0');
INSERT INTO `sys_course_type` VALUES ('55', '流行舞', '17', '美乐健身二店', '22', '流行舞', '3', '免费团课', '5', null, null, null, '60', '1', 'course/4e935c5d6eee4789a8c54dc14e7f2a62.jpg', '流行舞具有广泛的群众性和强烈的自娱性，是浅层审美意识的载体，它包括标准舞、爵士舞、街舞、拉丁舞、踢踏舞、迪斯科、劲舞等种类繁多的舞蹈。流行舞现在已经成为一种大众化的舞蹈，适合各个年龄，各个阶层的人群来学习，不论年龄，不分性别，都可以利用跳舞来达到自己的健身目的。', '#F16B62', '0');
INSERT INTO `sys_course_type` VALUES ('56', '爵士舞', '16', '美乐健身一店', '16', '爵士舞', '3', '免费团课', '5', null, null, null, '60', '1', 'course/305a0ba726964590b81f88da0a59e21f.jpg', '爵士舞即美国现代舞，是一种急促又富动感的节奏型舞蹈，是属于一种外放性的舞蹈，主要是追求愉快、活泼、有生气的一种舞蹈。它的特征是可自由自在的跳，爵士舞动作的本质是一种自由而纯朴的表现，直接把内心的感受用身体的颠，抖，扭表达出来。就像我们听到喜欢的音乐，能从内心自然的流露出感情，身体就不由自主的随著音乐节奏而活动，如弹响手指，摆首顿足，时而兴奋激烈，时而缓慢优柔的溶入音乐之中。', '#00C2B1', '0');
INSERT INTO `sys_course_type` VALUES ('57', '健美操', '16', '美乐健身一店', '19', '健美操', '3', '免费团课', '5', null, null, null, '60', '1', 'course/6eabac61e7c445aab6c7b836b6d0d10e.jpg', '健美操是一项深受广大群众喜爱的、普及性极强的，集体操、舞蹈、音乐、健身、娱乐于一体的体育项目。健美操中大量吸收了迪斯科舞、爵士舞、霹雳舞中的上下肢、躯干、头颈和足踩动作，特别是髋部动作，这给健美操增添了活力，同时也有利于减少臀部和腹部脂肪的堆积，有利于改善动作的协调性和灵活性。健美操是一种有氧运动，特征是持续一定时间的、中低程度的全身运动，主要锻炼练习者的心肺功能，是有氧耐力素质的基础。 跳健美操有诸多好处，不仅能帮助我们有效的强身健体，而且还有减肥的功效，这种运动减肥方法集健美和健身于一体，特别适合女性，受到了广大女性同胞的喜爱。', '#1D35EA', '0');
INSERT INTO `sys_course_type` VALUES ('58', '爵士舞', '17', '美乐健身二店', '16', '爵士舞', '3', '免费团课', '5', null, null, null, '60', '1', 'course/bb5985c2f1ed493093d1a7039d9ad0ec.jpg', '爵士舞即美国现代舞，是一种急促又富动感的节奏型舞蹈，是属于一种外放性的舞蹈，主要是追求愉快、活泼、有生气的一种舞蹈。它的特征是可自由自在的跳，爵士舞动作的本质是一种自由而纯朴的表现，直接把内心的感受用身体的颠，抖，扭表达出来。就像我们听到喜欢的音乐，能从内心自然的流露出感情，身体就不由自主的随著音乐节奏而活动，如弹响手指，摆首顿足，时而兴奋激烈，时而缓慢优柔的溶入音乐之中。', '#ED4014', '0');
INSERT INTO `sys_course_type` VALUES ('59', '健美操', '17', '美乐健身二店', '13', '健美操', '3', '免费团课', '5', null, null, null, '60', '1', 'course/fe6bcb1260864cda8224dce856d262bb.jpg', '健美操是一项深受广大群众喜爱的、普及性极强的，集体操、舞蹈、音乐、健身、娱乐于一体的体育项目。健美操中大量吸收了迪斯科舞、爵士舞、霹雳舞中的上下肢、躯干、头颈和足踩动作，特别是髋部动作，这给健美操增添了活力，同时也有利于减少臀部和腹部脂肪的堆积，有利于改善动作的协调性和灵活性。健美操是一种有氧运动，特征是持续一定时间的、中低程度的全身运动，主要锻炼练习者的心肺功能，是有氧耐力素质的基础。 跳健美操有诸多好处，不仅能帮助我们有效的强身健体，而且还有减肥的功效，这种运动减肥方法集健美和健身于一体，特别适合女性，受到了广大女性同胞的喜爱。', '#00B5FF', '0');
INSERT INTO `sys_course_type` VALUES ('60', 'HIIT体能训练', '18', '美乐健身三店', '11', 'HIIT体能训练', '3', '免费团课', '5', null, null, null, '60', '1', 'course/2ba0a1498fe24aa8b220a4f74c570b22.png', '体能是通过力量、速度、耐力、协调、柔韧、灵敏等运动素质表现出来的人体基本的运动能力，是运动员竞技能力的重要构成因素。体能水平的高低与人体的形态学特征以及人体的机能特征有着密切的相关 。', '#FF9900', '0');
INSERT INTO `sys_course_type` VALUES ('61', '流行舞', '18', '美乐健身三店', '8', '流行舞', '3', '免费团课', '5', null, null, null, '60', '1', 'course/b68e6ab448c54ddbaddfd7a7eaa5ccf6.jpg', '流行舞具有广泛的群众性和强烈的自娱性，是浅层审美意识的载体，它包括标准舞、爵士舞、街舞、拉丁舞、踢踏舞、迪斯科、劲舞等种类繁多的舞蹈。流行舞现在已经成为一种大众化的舞蹈，适合各个年龄，各个阶层的人群来学习，不论年龄，不分性别，都可以利用跳舞来达到自己的健身目的。', '#19BE6B', '0');
INSERT INTO `sys_course_type` VALUES ('62', '杠铃操', '18', '美乐健身三店', '9', '杠铃操', '3', '免费团课', '5', null, null, null, '60', '1', 'course/e07b20b20d3e4642a5a9658c23ee346a.jpg', '杠铃操 世界上最快的塑身方法是健身史上最成功的集体健身项目，世界上最快塑造形体、减少脂肪的运动。它成功地将杠铃引入操房，运用杠铃达到良好的塑身效果，将有氧运动与无氧运动完美结合，带来了集体健身的革命性突破。简单易学，成为增强体力和自信的起点。富有节奏的音乐和新颖的动作编排，伴随您完成1小时的练习。在热情高涨、激动人心的氛围中进行身体锻炼，适合每个想将力量训练与有氧训练结合起来的人。', '#ED4014', '0');
INSERT INTO `sys_course_type` VALUES ('63', '哈他瑜伽', '18', '美乐健身三店', '13', '哈他瑜伽', '3', '免费团课', '5', null, null, null, '60', '1', 'course/ede5d47ba4aa4013ac1bce5ded10cd22.jpg', 'Hatha（哈他）伽这是一种传统的伽练习，适合任何级别的练习者，对身体的各部位进行科学而平衡的伸展和锻炼，达到通经脉改善呼吸、平衡身心的功效。是由许多确伽势组成。，但不像 Ashtanga（阿斯汤伽）那样有连性，较容易些，但同样有挑战性哈他瑜伽通过体位练习达到强身健体，畸通经脉，同时练习会带来专注和思想的纯洁健康，人体包括两个体系为精神体系，一为肌体体系。', '#19BE6B', '0');
INSERT INTO `sys_course_type` VALUES ('64', '速度与激情', '18', '美乐健身三店', '1', '动感单车', '3', '免费团课', '5', null, null, null, '60', '1', 'course/a820e05df5c74ebcbfc8c610354cb8dc.jpg', '动感单车，又名燃脂炸弹 英文名字（SPINNING），是由美国私人教练兼极限运动员JOHNNYG于二十世纪八十年代首创，是一种结合了音乐、视觉效果等独特的充满活力的室内自行车训练课程。\n动感单车在克服了室外行驶的一切缺点后，由于技术上的改进，使得这项运动在简单易学之余，成为一项能够使全身得到锻炼的有氧运动。\n', '#FF9900', '0');
INSERT INTO `sys_course_type` VALUES ('65', '狂欢之夜', '18', '美乐健身三店', '1', '动感单车', '3', '免费团课', '5', null, null, null, '60', '1', 'course/aaf92c11b05643aea7c6a30d2e9492c9.jpg', '动感单车，又名燃脂炸弹 英文名字（SPINNING），是由美国私人教练兼极限运动员JOHNNYG于二十世纪八十年代首创，是一种结合了音乐、视觉效果等独特的充满活力的室内自行车训练课程。\n动感单车在克服了室外行驶的一切缺点后，由于技术上的改进，使得这项运动在简单易学之余，成为一项能够使全身得到锻炼的有氧运动。\n', '#2D8CF0', '0');
INSERT INTO `sys_course_type` VALUES ('66', '风驰电掣', '18', '美乐健身三店', '1', '动感单车', '3', '免费团课', '5', null, null, null, '60', '1', 'course/7391c03ccaf44da1a83af195716ed231.jpg', '动感单车，又名燃脂炸弹 英文名字（SPINNING），是由美国私人教练兼极限运动员JOHNNYG于二十世纪八十年代首创，是一种结合了音乐、视觉效果等独特的充满活力的室内自行车训练课程。\n动感单车在克服了室外行驶的一切缺点后，由于技术上的改进，使得这项运动在简单易学之余，成为一项能够使全身得到锻炼的有氧运动。\n', '#19BE6B', '0');
INSERT INTO `sys_course_type` VALUES ('67', '急速风驰', '18', '美乐健身三店', '1', '动感单车', '3', '免费团课', '5', null, null, null, '60', '1', 'course/9f20100a18954cbebff0b6f60101e7ae.jpg', '动感单车，又名燃脂炸弹 英文名字（SPINNING），是由美国私人教练兼极限运动员JOHNNYG于二十世纪八十年代首创，是一种结合了音乐、视觉效果等独特的充满活力的室内自行车训练课程。\n动感单车在克服了室外行驶的一切缺点后，由于技术上的改进，使得这项运动在简单易学之余，成为一项能够使全身得到锻炼的有氧运动。\n', '#19BE6B', '0');
INSERT INTO `sys_course_type` VALUES ('68', '基础瑜伽', '18', '美乐健身三店', '16', '基础瑜伽', '3', '免费团课', '5', null, null, null, '60', '1', 'course/c7ac8b9ecd074632baa2afba4d8b6a7b.jpg', '基础瑜伽  瑜伽是一项有着5000年历史的关于身体、心理以及精神的练习，起源于印度，其目的是改善您的身体和心', '#FF9900', '0');
INSERT INTO `sys_course_type` VALUES ('69', 'Hatha  Yoga', '18', '美乐健身三店', '16', '基础瑜伽', '3', '免费团课', '5', null, null, null, '60', '1', 'course/ba0c17f6a6344e12920f810a61546811.jpg', 'Hatha（哈他）伽这是一种传统的伽练习，适合任何级别的练习者，对身体的各部位进行科学而平衡的伸展和锻炼，达到通经脉改善呼吸、平衡身心的功效。是由许多确伽势组成。，但不像 Ashtanga（阿斯汤伽）那样有连性，较容易些，但同样有挑战性哈他瑜伽通过体位练习达到强身健体，畸通经脉，同时练习会带来专注和思想的纯洁健康，人体包括两个体系为精神体系，一为肌体体系。', '#FF9900', '0');
INSERT INTO `sys_course_type` VALUES ('70', '疯狂挑战', '16', '美乐健身一店', '2', '动感单车', '3', '免费团课', '5', null, null, null, '60', '1', 'course/340bdda679b5486bb26704c8d5fc6d67.jpg', '动感单车，又名燃脂炸弹 英文名字（SPINNING），是由美国私人教练兼极限运动员JOHNNYG于二十世纪八十年代首创，是一种结合了音乐、视觉效果等独特的充满活力的室内自行车训练课程。\n动感单车在克服了室外行驶的一切缺点后，由于技术上的改进，使得这项运动在简单易学之余，成为一项能够使全身得到锻炼的有氧运动\n', '#2D8CF0', '0');
INSERT INTO `sys_course_type` VALUES ('71', '风驰电掣', '16', '美乐健身一店', '2', '动感单车', '3', '免费团课', '5', null, null, null, '60', '1', 'course/568e6164392d4cc09b7655b5cda5a04b.jpg', '动感单车，又名燃脂炸弹 英文名字（SPINNING），是由美国私人教练兼极限运动员JOHNNYG于二十世纪八十年代首创，是一种结合了音乐、视觉效果等独特的充满活力的室内自行车训练课程。\n动感单车在克服了室外行驶的一切缺点后，由于技术上的改进，使得这项运动在简单易学之余，成为一项能够使全身得到锻炼的有氧运动\n', '#2D8CF0', '0');
INSERT INTO `sys_course_type` VALUES ('72', '塑身瑜伽', '16', '美乐健身一店', '9', '瘦身瑜伽', '3', '免费团课', '5', null, null, null, '60', '1', 'course/64eb2edac9e7435f8e0b65135e6db300.jpg', '塑身瑜伽针对身体细部及整，全面塑造健康，完美的体形，并通过这些简明，专业而饶有趣味的练习，进一步激发机体潜能，增强机体内部力量，提高身体柔韧性，平衡性，减缓精神压力，让你随时随地感到精力充沛，心情舒畅!', '#ED4014', '0');
INSERT INTO `sys_course_type` VALUES ('73', '阶梯有氧', '16', '美乐健身一店', '19', '健美操', '3', '免费团课', '5', null, null, null, '60', '1', 'course/b2dfbdd8e60f4e9d9c653fbd73afb448.jpg', '健美操是一项深受广大群众喜爱的、普及性极强的，集体操、舞蹈、音乐、健身、娱乐于一体的体育项目。健美操中大量吸收了迪斯科舞、爵士舞、霹雳舞中的上下肢、躯干、头颈和足踩动作，特别是髋部动作，这给健美操增添了活力，同时也有利于减少臀部和腹部脂肪的堆积，有利于改善动作的协调性和灵活性。健美操是一种有氧运动，特征是持续一定时间的、中低程度的全身运动，主要锻炼练习者的心肺功能，是有氧耐力素质的基础。 跳健美操有诸多好处，不仅能帮助我们有效的强身健体，而且还有减肥的功效，这种运动减肥方法集健美和健身于一体，特别适合女性，受到了广大女性同胞的喜爱。', '#00B5FF', '0');
INSERT INTO `sys_course_type` VALUES ('74', 'body jam', '16', '美乐健身一店', '14', 'HIIT体能训练', '3', '免费团课', '5', null, null, null, '60', '1', 'course/ca880bd1b3ad43a1a652b3e8f5fa905f.png', '体能是通过力量、速度、耐力、协调、柔韧、灵敏等运动素质表现出来的人体基本的运动能力，是运动员竞技能力的重要构成因素。体能水平的高低与人体的形态学特征以及人体的机能特征有着密切的相关 。', '#0D94AA', '0');
INSERT INTO `sys_course_type` VALUES ('75', 'body attack', '16', '美乐健身一店', '19', '健美操', '3', '免费团课', '5', null, null, null, '60', '1', 'course/816dd0c68b8a492290e43601854ac99c.jpg', '健美操是一项深受广大群众喜爱的、普及性极强的，集体操、舞蹈、音乐、健身、娱乐于一体的体育项目。健美操中大量吸收了迪斯科舞、爵士舞、霹雳舞中的上下肢、躯干、头颈和足踩动作，特别是髋部动作，这给健美操增添了活力，同时也有利于减少臀部和腹部脂肪的堆积，有利于改善动作的协调性和灵活性。健美操是一种有氧运动，特征是持续一定时间的、中低程度的全身运动，主要锻炼练习者的心肺功能，是有氧耐力素质的基础。 跳健美操有诸多好处，不仅能帮助我们有效的强身健体，而且还有减肥的功效，这种运动减肥方法集健美和健身于一体，特别适合女性，受到了广大女性同胞的喜爱', '#FEBD79', '0');
INSERT INTO `sys_course_type` VALUES ('76', '塑身瑜伽', '17', '美乐健身二店', '7', '瘦身瑜伽', '3', '免费团课', '5', null, null, null, '60', '1', 'course/da67c8e9b2fa4444b1660b4dce730755.jpg', '塑身瑜伽针对身体细部及整，全面塑造健康，完美的体形，并通过这些简明，专业而饶有趣味的练习，进一步激发机体潜能，增强机体内部力量，提高身体柔韧性，平衡性，减缓精神压力，让你随时随地感到精力充沛，心情舒畅', '#AC7A33', '0');
INSERT INTO `sys_course_type` VALUES ('77', '力量瑜伽', '17', '美乐健身二店', '10', '哈他瑜伽', '3', '免费团课', '5', null, null, null, '60', '1', 'course/21d5cd35f4b74dabae543c72cdba5e4c.jpg', '力量瑜伽', '#EA4CA3', '0');
INSERT INTO `sys_course_type` VALUES ('78', '火箭流', '17', '美乐健身二店', '6', '基础瑜伽', '3', '免费团课', '5', null, null, null, '60', '1', 'course/17ac43f89def414b9e0f15a977a6e6ba.jpg', '火箭流', '#0D94AA', '0');
INSERT INTO `sys_course_type` VALUES ('79', 'body attack', '17', '美乐健身二店', '13', '健美操', '3', '免费团课', '5', null, null, null, '60', '1', 'course/ce8431c655a84aa1a23df37a4bd9870e.jpg', '健美操是一项深受广大群众喜爱的、普及性极强的，集体操、舞蹈、音乐、健身、娱乐于一体的体育项目。健美操中大量吸收了迪斯科舞、爵士舞、霹雳舞中的上下肢、躯干、头颈和足踩动作，特别是髋部动作，这给健美操增添了活力，同时也有利于减少臀部和腹部脂肪的堆积，有利于改善动作的协调性和灵活性。健美操是一种有氧运动，特征是持续一定时间的、中低程度的全身运动，主要锻炼练习者的心肺功能，是有氧耐力素质的基础。 跳健美操有诸多好处，不仅能帮助我们有效的强身健体，而且还有减肥的功效，这种运动减肥方法集健美和健身于一体，特别适合女性，受到了广大女性同胞的喜爱。', '#CDDC39', '0');
INSERT INTO `sys_course_type` VALUES ('80', '阶梯有氧', '17', '美乐健身二店', '13', '健美操', '3', '免费团课', '5', null, null, null, '60', '1', 'course/b701733e6a9c402fa3a9dcd260f1a912.jpg', '健美操是一项深受广大群众喜爱的、普及性极强的，集体操、舞蹈、音乐、健身、娱乐于一体的体育项目。健美操中大量吸收了迪斯科舞、爵士舞、霹雳舞中的上下肢、躯干、头颈和足踩动作，特别是髋部动作，这给健美操增添了活力，同时也有利于减少臀部和腹部脂肪的堆积，有利于改善动作的协调性和灵活性。健美操是一种有氧运动，特征是持续一定时间的、中低程度的全身运动，主要锻炼练习者的心肺功能，是有氧耐力素质的基础。 跳健美操有诸多好处，不仅能帮助我们有效的强身健体，而且还有减肥的功效，这种运动减肥方法集健美和健身于一体，特别适合女性，受到了广大女性同胞的喜爱。', '#F06292', '0');
INSERT INTO `sys_course_type` VALUES ('81', '劲爆操课', '17', '美乐健身二店', '13', '健美操', '3', '免费团课', '5', null, null, null, '60', '1', 'course/d017e0bc9cf8484ea951edcea0ef2e45.jpg', '健美操是一项深受广大群众喜爱的、普及性极强的，集体操、舞蹈、音乐、健身、娱乐于一体的体育项目。健美操中大量吸收了迪斯科舞、爵士舞、霹雳舞中的上下肢、躯干、头颈和足踩动作，特别是髋部动作，这给健美操增添了活力，同时也有利于减少臀部和腹部脂肪的堆积，有利于改善动作的协调性和灵活性。健美操是一种有氧运动，特征是持续一定时间的、中低程度的全身运动，主要锻炼练习者的心肺功能，是有氧耐力素质的基础。 跳健美操有诸多好处，不仅能帮助我们有效的强身健体，而且还有减肥的功效，这种运动减肥方法集健美和健身于一体，特别适合女性，受到了广大女性同胞的喜爱。', '#00BCD4', '0');
INSERT INTO `sys_course_type` VALUES ('82', '有氧操课', '17', '美乐健身二店', '13', '健美操', '3', '免费团课', '5', null, null, null, '60', '1', 'course/e2d6628f41a5457981dc594bd148ead0.jpg', '健美操是一项深受广大群众喜爱的、普及性极强的，集体操、舞蹈、音乐、健身、娱乐于一体的体育项目。健美操中大量吸收了迪斯科舞、爵士舞、霹雳舞中的上下肢、躯干、头颈和足踩动作，特别是髋部动作，这给健美操增添了活力，同时也有利于减少臀部和腹部脂肪的堆积，有利于改善动作的协调性和灵活性。健美操是一种有氧运动，特征是持续一定时间的、中低程度的全身运动，主要锻炼练习者的心肺功能，是有氧耐力素质的基础。 跳健美操有诸多好处，不仅能帮助我们有效的强身健体，而且还有减肥的功效，这种运动减肥方法集健美和健身于一体，特别适合女性，受到了广大女性同胞的喜爱。', '#607D8B', '0');
INSERT INTO `sys_course_type` VALUES ('83', '战斗有氧', '17', '美乐健身二店', '2', '有氧搏击', '3', '免费团课', '5', null, null, null, '60', '1', 'course/7ba91fe6d7e44dbebed8362d1b09b397.jpg', '搏击操，是一种有氧操，它结合了拳击、泰拳、跆拳道、散手、太极的基本动作，遵循健美操最新编排方法，在强有力的音乐节拍下完成的一种身体锻炼方式。有氧搏击操英文名为kickboxing，最早是由欧洲的搏击选手与职业健身操运动员推出的，其具体形式是将拳击、空手道、跆拳道功夫，甚至一些舞蹈动作混合在一起，并配合强劲的音乐，成为一类风格独特的健身操。', '#9B1DEA', '0');
INSERT INTO `sys_course_type` VALUES ('84', '急速飞驰', '17', '美乐健身二店', '1', '动感单车', '3', '免费团课', '5', null, null, null, '60', '1', 'course/05658bec35bd46d08f9853098a5a7df1.jpg', '动感单车，又名燃脂炸弹 英文名字（SPINNING），是由美国私人教练兼极限运动员JOHNNYG于二十世纪八十年代首创，是一种结合了音乐、视觉效果等独特的充满活力的室内自行车训练课程。\n动感单车在克服了室外行驶的一切缺点后，由于技术上的改进，使得这项运动在简单易学之余，成为一项能够使全身得到锻炼的有氧运动。\n', '#2D8CF0', '0');
INSERT INTO `sys_course_type` VALUES ('85', '新感觉', '17', '美乐健身二店', '1', '动感单车', '3', '免费团课', '5', null, null, null, '60', '1', 'course/c71238f0847a4940917f0aab8096fac9.jpg', '动感单车，又名燃脂炸弹 英文名字（SPINNING），是由美国私人教练兼极限运动员JOHNNYG于二十世纪八十年代首创，是一种结合了音乐、视觉效果等独特的充满活力的室内自行车训练课程。\n动感单车在克服了室外行驶的一切缺点后，由于技术上的改进，使得这项运动在简单易学之余，成为一项能够使全身得到锻炼的有氧运动。\n', '#2D8CF0', '0');
INSERT INTO `sys_course_type` VALUES ('86', '脂肪终结者', '17', '美乐健身二店', '1', '动感单车', '3', '免费团课', '5', null, null, null, '60', '1', 'course/9a54fed715da47d3a0f2a9d9331be4d4.jpg', '动感单车，又名燃脂炸弹 英文名字（SPINNING），是由美国私人教练兼极限运动员JOHNNYG于二十世纪八十年代首创，是一种结合了音乐、视觉效果等独特的充满活力的室内自行车训练课程。\n动感单车在克服了室外行驶的一切缺点后，由于技术上的改进，使得这项运动在简单易学之余，成为一项能够使全身得到锻炼的有氧运动。\n', '#2D8CF0', '0');
INSERT INTO `sys_course_type` VALUES ('87', '极限挑战', '17', '美乐健身二店', '1', '动感单车', '3', '免费团课', '5', null, null, null, '60', '1', 'course/914afce9306f49529b5e9a5f6b676de7.jpg', '动感单车，又名燃脂炸弹 英文名字（SPINNING），是由美国私人教练兼极限运动员JOHNNYG于二十世纪八十年代首创，是一种结合了音乐、视觉效果等独特的充满活力的室内自行车训练课程。\n动感单车在克服了室外行驶的一切缺点后，由于技术上的改进，使得这项运动在简单易学之余，成为一项能够使全身得到锻炼的有氧运动。\n', '#2D8CF0', '0');
INSERT INTO `sys_course_type` VALUES ('88', '东方舞', '16', '美乐健身一店', '3', '肚皮舞', '3', '免费团课', '5', null, null, null, '60', '1', 'course/2811c39a8ed34067943717fce15d76e2.png', '东方舞是一种全身的运动，可以让你的腿部、腹部、肩膀以及颈部都得到充分的活动，从而提高身体的弹性和柔初性。手臂的动作非常重要，它能表达出舞者的优雅和精巧。它不仅仅是一种运动，它也为心灵与身体建立了一种精神纽带。你可以象蝴蝶、海浪、流水一样欢快与自由。当你翩翩起舞时，你体内的女神让你变得更优雅、更有力量、更加性感。它是女士探素自身的舞蹈，是对身体和内心世界的探险。', '#ED4014', '0');
INSERT INTO `sys_course_type` VALUES ('89', 'HIIT体能训练', '17', '美乐健身二店', '20', 'HIIT体能训练', '3', '免费团课', '5', null, null, null, '60', '1', 'course/d8a0aca6792e4d7dbfd0f3b051069a7d.jpg', '体能是通过力量、速度、耐力、协调、柔韧、灵敏等运动素质表现出来的人体基本的运动能力，是运动员竞技能力的重要构成因素。体能水平的高低与人体的形态学特征以及人体的机能特征有着密切的相关 。', '#ED4014', '0');
INSERT INTO `sys_course_type` VALUES ('90', '新感觉', '17', '美乐健身二店', '1', '动感单车', '3', '免费团课', '5', null, null, null, '60', '1', 'course/c1b6f02b42d442899718b5b349023b91.jpg', '动感单车，又名燃脂炸弹 英文名字（SPINNING），是由美国私人教练兼极限运动员JOHNNYG于二十世纪八十年代首创，是一种结合了音乐、视觉效果等独特的充满活力的室内自行车训练课程。\n动感单车在克服了室外行驶的一切缺点后，由于技术上的改进，使得这项运动在简单易学之余，成为一项能够使全身得到锻炼的有氧运动。\n', '#F06292', '0');
INSERT INTO `sys_course_type` VALUES ('91', '健美操', '18', '美乐健身三店', '2', '健美操', '3', '免费团课', '5', null, null, null, '60', '1', 'course/9ccce5e43a4e438ea5b6a768aaa1bee2.jpg', '健美操是一项深受广大群众喜爱的、普及性极强的，集体操、舞蹈、音乐、健身、娱乐于一体的体育项目。健美操中大量吸收了迪斯科舞、爵士舞、霹雳舞中的上下肢、躯干、头颈和足踩动作，特别是髋部动作，这给健美操增添了活力，同时也有利于减少臀部和腹部脂肪的堆积，有利于改善动作的协调性和灵活性。健美操是一种有氧运动，特征是持续一定时间的、中低程度的全身运动，主要锻炼练习者的心肺功能，是有氧耐力素质的基础。 跳健美操有诸多好处，不仅能帮助我们有效的强身健体，而且还有减肥的功效，这种运动减肥方法集健美和健身于一体，特别适合女性，受到了广大女性同胞的喜爱。', '#607D8B', '0');
INSERT INTO `sys_course_type` VALUES ('92', '踏板操', '18', '美乐健身三店', '3', '踏板操', '3', '免费团课', '5', null, null, null, '60', '1', 'course/0ebb9afa7441462fb91fc0edd9634ec1.jpg', '踏板操：主要针对下肢和臀部具有明显耗能减脂，提臀美腿一节课可以消耗1000卡路里，具有改善女性肌肉线条功效。', '#607D8B', '0');
INSERT INTO `sys_course_type` VALUES ('93', '低温瑜伽私教', '2', '702俱乐部', '1', '瑜伽', '1', '单人私教', '4', '300', '100', '100', '60', '1', 'course/91c0f2cc80904de88703d81ab7ef0f52.png', '123123123123', '#19BE6B', '0');
INSERT INTO `sys_course_type` VALUES ('94', '亚茹专属课程', '2', '702俱乐部', '1', '瑜伽', '1', '单人私教', '2', '180', '20000', '60', '60', '1', 'course/d6badacc11b641e88a6ddc588d2572af.png', '哈哈哈哈哈', '#2D8CF0', '0');
INSERT INTO `sys_course_type` VALUES ('95', '亚茹专属小团课', '2', '702俱乐部', '1', '瑜伽', '2', '小团体私教', '2', '180', '2', '6', '60', '1', 'course/1673bd493daa472483627e5e938acf52.jpg', '啦啦啦啦啦', '#19BE6B', '0');
INSERT INTO `sys_course_type` VALUES ('96', '团操', '33', '白鹭店', '28', '瑜伽', '1', '单人私教', '2', '180', '800', '10', '60', '1', 'course/bb953fa1a1234f99822c3b19d6ee172d.png', '1', '#ED4014', '0');
INSERT INTO `sys_course_type` VALUES ('97', '瑜伽1', '33', '白鹭店', '28', '瑜伽', '2', '小团体私教', '4', '200', '600', '5', '60', '1', 'course/4a5b7968e0914be59e815d1d5efdc46d.png', '1', '#F9E31C', '0');
INSERT INTO `sys_course_type` VALUES ('98', '瑜伽免1', '33', '白鹭店', '28', '瑜伽', '3', '免费团课', '5', null, null, null, '10', '1', 'course/7964a994b76d403da2d94fc04f8d25f2.png', '1', '#9B1DEA', '0');
INSERT INTO `sys_course_type` VALUES ('99', '测试课种编辑功能用的', '2', '702俱乐部', '1', '瑜伽', '1', '单人私教', '2', '123', '123', '123', '60', '1', 'course/29b95e4781b34725bada27c3397f3a5d.png', '123123', '#2D8CF0', '0');
INSERT INTO `sys_course_type` VALUES ('100', '通用卡种测试', '2', '702俱乐部', '1', '瑜伽', '1', '单人私教', '2', '12', '111', '1', '60', '1', 'course/64ad08888afc4b3b80c73193656642cd.png', '通用卡种测试', '#FF9900', '1');
INSERT INTO `sys_course_type` VALUES ('101', '测试通用课种2', '2', '702俱乐部', '3', '团体私教', '1', '单人私教', '4', '23', '222', '22', '60', '1', 'course/ab124707762343f1962a799830096b62.png', '测试通用课种2', '#19BE6B', '1');
INSERT INTO `sys_course_type` VALUES ('102', '大师傅', '2', '702俱乐部', '1', '瑜伽', '2', '小团体私教', '2', '12', '231', '123', '60', '1', 'course/bab0cbbf9d65499a9f84adca32ccb7c4.png', '发顺丰', '#19BE6B', '1');
INSERT INTO `sys_course_type` VALUES ('103', '再来测试', '2', '702俱乐部', '1', '瑜伽', '1', '单人私教', '2', '12', '123', '12', '60', '1', 'course/619159fff7534ae7885ae41fb2b91b48.png', '再来测试', '#2D8CF0', '1');
INSERT INTO `sys_course_type` VALUES ('104', '添加通用课', '2', '702俱乐部', '1', '瑜伽', '1', '单人私教', '2', '12', '122112', '1212', '60', '1', 'course/d771d63bae4e482fbfe24337b5580d71.png', '添加通用课', '#2D8CF0', '1');
INSERT INTO `sys_course_type` VALUES ('105', '非通用改通用', '2', '702俱乐部', '1', '瑜伽', '1', '单人私教', '2', '12', '2', '12', '60', '1', 'course/991f89918de64d4a9fa1cab6bca90bf1.png', '非通用改通用', '#FF9900', '0');
INSERT INTO `sys_course_type` VALUES ('106', '非通用改通用', '2', '702俱乐部', '1', '瑜伽', '1', '单人私教', '2', '12', '2', '12', '60', '1', 'course/991f89918de64d4a9fa1cab6bca90bf1.png', '非通用改通用', '#FF9900', '1');
INSERT INTO `sys_course_type` VALUES ('107', '非通用改通用第二波', '2', '702俱乐部', '1', '瑜伽', '1', '单人私教', '2', '12', '231', '123', '60', '1', 'course/5063eca09d494648aaf87f0d06aa6db0.png', '123非通用改通用第二波', '#19BE6B', '1');
INSERT INTO `sys_course_type` VALUES ('116', 'IMemberClient', '2', '702俱乐部', '1', '瑜伽', '1', '单人私教', '2', '60', '6000', '60', '60', '1', 'course/54b302660ca44b4ea9ff399801f268bf.png', 'IMemberClient', '#2D8CF0', '0');
INSERT INTO `sys_course_type` VALUES ('118', '鸠摩智私教', '2', '702俱乐部', '2', '舞蹈', '1', '单人私教', '2', '15', '8', '14', '60', '1', 'course/eed439ce18834d2690d2d6a284b9d8ac.png', '下实打实大阿萨德阿萨德爱上', '#ED4014', '0');
INSERT INTO `sys_course_type` VALUES ('119', '鸠摩智小团课', '2', '702俱乐部', '2', '舞蹈', '2', '小团体私教', '2', '100', '2', '18', '40', '1', 'course/198795120cc141648817414afe662585.png', '这是一节很好的课', '#2D8CF0', '0');

-- ----------------------------
-- Table structure for `sys_menu`
-- ----------------------------
DROP TABLE IF EXISTS `sys_menu`;
CREATE TABLE `sys_menu` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `parent_id` bigint(20) DEFAULT NULL COMMENT '父菜单ID，一级菜单为0',
  `name` varchar(50) DEFAULT NULL COMMENT '菜单名称',
  `url` varchar(200) DEFAULT NULL COMMENT '菜单URL',
  `perms` varchar(500) DEFAULT NULL COMMENT '授权(多个用逗号分隔，如：user:list,user:create)',
  `type` int(11) DEFAULT NULL COMMENT '类型   0：目录   1：菜单   2：按钮',
  `icon` varchar(50) DEFAULT NULL COMMENT '菜单图标',
  `order_num` int(11) DEFAULT NULL COMMENT '排序',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=36 DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT COMMENT='菜单管理';

-- ----------------------------
-- Records of sys_menu
-- ----------------------------
INSERT INTO `sys_menu` VALUES ('1', '0', '系统管理', null, null, '0', 'fa fa-cog', '0');
INSERT INTO `sys_menu` VALUES ('2', '1', '用户管理', '/user', null, '1', 'fa fa-user', '2');
INSERT INTO `sys_menu` VALUES ('3', '1', '角色管理', '/role', null, '1', 'fa fa-user-secret', '3');
INSERT INTO `sys_menu` VALUES ('4', '1', '菜单管理', '/menu', null, '1', 'fa fa-th-list', '4');
INSERT INTO `sys_menu` VALUES ('31', '1', '代码生成器', '/generator', null, '1', 'fa fa-code', '1');

-- ----------------------------
-- Table structure for `sys_role`
-- ----------------------------
DROP TABLE IF EXISTS `sys_role`;
CREATE TABLE `sys_role` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `role_name` varchar(100) DEFAULT NULL COMMENT '角色名称',
  `remark` varchar(100) DEFAULT NULL COMMENT '备注',
  `create_user_id` bigint(20) DEFAULT NULL COMMENT '创建者ID',
  `create_time` datetime DEFAULT NULL COMMENT '创建时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT COMMENT='角色';

-- ----------------------------
-- Records of sys_role
-- ----------------------------
INSERT INTO `sys_role` VALUES ('1', '管理员啊', '管理员啊', '1', '2018-12-11 17:47:55');

-- ----------------------------
-- Table structure for `sys_role_menu`
-- ----------------------------
DROP TABLE IF EXISTS `sys_role_menu`;
CREATE TABLE `sys_role_menu` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `role_id` bigint(20) DEFAULT NULL COMMENT '角色ID',
  `menu_id` bigint(20) DEFAULT NULL COMMENT '菜单ID',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT COMMENT='角色与菜单对应关系';

-- ----------------------------
-- Records of sys_role_menu
-- ----------------------------
INSERT INTO `sys_role_menu` VALUES ('1', '1', '2');
INSERT INTO `sys_role_menu` VALUES ('2', '1', '3');
INSERT INTO `sys_role_menu` VALUES ('3', '1', '-666666');
INSERT INTO `sys_role_menu` VALUES ('4', '1', '1');

-- ----------------------------
-- Table structure for `sys_user`
-- ----------------------------
DROP TABLE IF EXISTS `sys_user`;
CREATE TABLE `sys_user` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `username` varchar(50) DEFAULT NULL COMMENT '用户名',
  `password` varchar(100) DEFAULT NULL COMMENT '密码',
  `name` varchar(30) DEFAULT NULL COMMENT '姓名',
  `salt` varchar(20) DEFAULT NULL COMMENT '盐',
  `email` varchar(100) DEFAULT NULL COMMENT '邮箱',
  `mobile` varchar(100) DEFAULT NULL COMMENT '手机号',
  `status` tinyint(4) DEFAULT NULL COMMENT '状态  0：禁用   1：正常',
  `create_user_id` bigint(20) DEFAULT NULL COMMENT '创建者ID',
  `create_time` datetime DEFAULT NULL COMMENT '创建时间',
  `gender` tinyint(4) DEFAULT NULL COMMENT '性别 1男 0女',
  `avatar` varchar(255) DEFAULT NULL COMMENT '头像',
  PRIMARY KEY (`id`),
  UNIQUE KEY `mobile` (`mobile`),
  UNIQUE KEY `username` (`username`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT COMMENT='系统用户';

-- ----------------------------
-- Records of sys_user
-- ----------------------------
INSERT INTO `sys_user` VALUES ('1', 'admin', '9ec9750e709431dad22365cabc5c625482e574c74adaebba7dd02f1129e4ce1d', null, 'YzcmCZNvbXocrsz9dm8e', 'root@renren.io', '13612345678', '1', '1', '2016-11-11 11:11:11', null, null);
INSERT INTO `sys_user` VALUES ('2', '123', 'e8318eeabb448d6dd8a45ea0725205f8fbba0bc63cf572366ac7981272c4af9a', '123', 'SN0UXPKCN9qrAg1xsmvE', '123', '123', '1', '1', '2018-12-11 17:48:05', null, null);

-- ----------------------------
-- Table structure for `sys_user_role`
-- ----------------------------
DROP TABLE IF EXISTS `sys_user_role`;
CREATE TABLE `sys_user_role` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `user_id` bigint(20) DEFAULT NULL COMMENT '用户ID',
  `role_id` bigint(20) DEFAULT NULL COMMENT '角色ID',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT COMMENT='用户与角色对应关系';

-- ----------------------------
-- Records of sys_user_role
-- ----------------------------
INSERT INTO `sys_user_role` VALUES ('2', '2', '1');
